//
//国测局坐标(火星坐标,比如高德地图在用),百度坐标,wgs84坐标(谷歌国外以及绝大部分国外在线地图使用的坐标)
var coordtransform = require('coordtransform');
// 百度坐标集合
const bd09Points = [
  [104.084988, 30.515381],
  [104.094727, 30.513668],
  [104.098316, 30.505244],
  [104.11199, 30.511687],
  [104.107465, 30.523282],
  [104.109313, 30.530003],
  [104.101903, 30.530771],
  [104.095772, 30.527225],
  [104.106972, 30.530294],
  [104.109405, 30.531126],
  [104.107463, 30.532164],
  [104.100304, 30.531326],
  [104.09521, 30.512124],
  [104.098427, 30.505791],
  [104.094794, 30.52725],
  [104.100964, 30.533136],
  [104.096675, 30.527361],
  [104.096921, 30.529639],
  [104.109874, 30.522232],
  [104.107895, 30.513365],
  [104.090313, 30.525833],
  [104.095, 30.512821],
  [104.083386, 30.520753],
  [104.082928, 30.520795],
  [104.088655, 30.522282],
  [104.089587, 30.517811],
];

// let result = [];
let str = '';
bd09Points.forEach((point) => {
  //百度经纬度坐标转国测局坐标
  var bd09togcj02 = coordtransform.bd09togcj02(point[0], point[1]);

  //   result.push(bd09togcj02);
  // str = str.concat(`${bd09togcj02[0]},${bd09togcj02[1]}\r\n`); // 国测坐标 GCJ02

  //国测局坐标转wgs84坐标
  var gcj02towgs84 = coordtransform.gcj02towgs84(
    bd09togcj02[0],
    bd09togcj02[1]
  );

  //   result.push(gcj02towgs84);
  str = str.concat(`${gcj02towgs84[0]},${gcj02towgs84[1]}\r\n`); // WGS84
});

// console.log(result);
console.log(str);
